#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.aws-route-53.aws_route53_record.galaxyletter_com_A will be destroyed
  - resource "aws_route53_record" "galaxyletter_com_A" {
      - fqdn    = "galaxyletter.com" -> null
      - id      = "Z3S70Y7U7DI2H0_galaxyletter.com_A" -> null
      - name    = "galaxyletter.com" -> null
      - records = [
          - "185.199.108.153",
          - "185.199.109.153",
          - "185.199.110.153",
          - "185.199.111.153",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z3S70Y7U7DI2H0" -> null
    }

  # module.aws-route-53.aws_route53_record.galaxyletter_com_NS will be destroyed
  - resource "aws_route53_record" "galaxyletter_com_NS" {
      - fqdn    = "galaxyletter.com" -> null
      - id      = "Z3S70Y7U7DI2H0_galaxyletter.com_NS" -> null
      - name    = "galaxyletter.com" -> null
      - records = [
          - "ns-1142.awsdns-14.org",
          - "ns-2003.awsdns-58.co.uk",
          - "ns-204.awsdns-25.com",
          - "ns-702.awsdns-23.net",
        ] -> null
      - ttl     = 172800 -> null
      - type    = "NS" -> null
      - zone_id = "Z3S70Y7U7DI2H0" -> null
    }

  # module.aws-route-53.aws_route53_record.ja_blog_shunkakinoki_com_CNAME will be created
  + resource "aws_route53_record" "ja_blog_shunkakinoki_com_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ja.blog.shunkakinoki.com"
      + records         = [
          + "shunkakinoki.github.io",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z19V0BNFYY29A"
    }

  # module.aws-route-53.aws_route53_record.ja_galaxyletter_com_CNAME will be destroyed
  - resource "aws_route53_record" "ja_galaxyletter_com_CNAME" {
      - fqdn    = "ja.galaxyletter.com" -> null
      - id      = "Z3S70Y7U7DI2H0_ja.galaxyletter.com._CNAME" -> null
      - name    = "ja.galaxyletter.com" -> null
      - records = [
          - "galaxyletter.github.io",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z3S70Y7U7DI2H0" -> null
    }

  # module.aws-route-53.aws_route53_record.journal_shunkakinoki_com_CNAME will be created
  + resource "aws_route53_record" "journal_shunkakinoki_com_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "journal.shunkakinoki.com"
      + records         = [
          + "shunkakinoki.github.io",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z19V0BNFYY29A"
    }

  # module.aws-route-53.aws_route53_zone.galaxyletter will be destroyed
  - resource "aws_route53_zone" "galaxyletter" {
      - comment       = "Managed by Terraform" -> null
      - force_destroy = false -> null
      - id            = "Z3S70Y7U7DI2H0" -> null
      - name          = "galaxyletter.com." -> null
      - name_servers  = [
          - "ns-1142.awsdns-14.org",
          - "ns-2003.awsdns-58.co.uk",
          - "ns-204.awsdns-25.com",
          - "ns-702.awsdns-23.net",
        ] -> null
      - tags          = {} -> null
      - zone_id       = "Z3S70Y7U7DI2H0" -> null
    }

Plan: 2 to add, 0 to change, 4 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
